{
    "description": {
        "name": "HTML: HyperText Markup Language",
        "topDescription": "&ltb'&gtHTML (HyperText Markup Language)&lt/b&gt is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript).  &ltHypertext&gt refers to links that connect web pages to one another, either within a single website or between websites. Links are a fundamental aspect of the Web. By uploading content to the Internet and linking it to pages created by other people, you become an active participant in the World Wide Web.",
        "about-tag": "HTML uses &ltmarkup&gt to annotate text, images, and other content for display in a Web browser. HTML markup includes special &ltelements&gt such as &lthead&gt, &lttitle&gt, &ltbody&gt, &ltheader&gt, &ltfooter&gt, &ltarticle&gt, &ltsection&gt, &ltp&gt, &ltdiv&gt, &ltspan&gt, &ltimg&gt, &ltaside&gt, &ltaudio&gt, &ltcanvas&gt, &ltdatalist&gt, &ltdetails&gt, &ltembed&gt, &ltnav&gt, &ltoutput&gt, &ltprogress&gt, &ltvideo&gt, &ltul&gt, &ltol&gt, &ltli&gt and many others. An HTML element is set off from other text in a document by &lttags&gt, which consist of the element name surrounded by -&lt- and -&gt-. The name of an element inside a tag is case insensitive. That is, it can be written in uppercase, lowercase, or a mixture. For example, the &lttitle&gt tag can be written as &ltTitle&gt, &ltTITLE&gt, or in any other way. However, the convention and recommended practice is to write tags in lowercase.",
         "tags":"&lthead&gt, &lttitle&gt, &ltbody&gt, &ltheader&gt, &ltfooter&gt, &ltarticle&gt, &ltsection&gt, &ltp&gt, &ltdiv&gt, &ltspan&gt, &ltimg&gt, &ltaside&gt, &ltaudio&gt, &ltcanvas&gt, &ltdatalist&gt, &ltdetails&gt, &ltembed&gt, &ltnav&gt, &ltoutput&gt, &ltprogress&gt, &ltvideo&gt, &ltul&gt, &ltol&gt, &ltli&gt",
         "Atag":"\t An HTML element is set off from other text in a document by 'tags' , which consist of the element name surrounded by '&lt' and '&gt'. The name of an element inside a tag is case insensitive. That is, it can be written in uppercase, lowercase, or a mixture. For example, the &lttitle&gt tag can be written as &ltTitle&gt, &ltTITLE&gt, or in any other way. However, the convention and recommended practice is to write tags in lowercase."
        
        }
}